<?php
/* Smarty version 5.4.2, created on 2025-01-26 11:51:01
  from 'file:C:/xampp/htdocs/portfolio/assets/frontend/mains/main_for_index.php' */

/* @var \Smarty\Template $_smarty_tpl */
if ($_smarty_tpl->getCompiled()->isFresh($_smarty_tpl, array (
  'version' => '5.4.2',
  'unifunc' => 'content_679613951b6523_76577031',
  'has_nocache_code' => false,
  'file_dependency' => 
  array (
    'c44051d5de50469d536d5ccc0c3c63576b7e1352' => 
    array (
      0 => 'C:/xampp/htdocs/portfolio/assets/frontend/mains/main_for_index.php',
      1 => 1737883032,
      2 => 'file',
    ),
  ),
  'includes' => 
  array (
  ),
))) {
function content_679613951b6523_76577031 (\Smarty\Template $_smarty_tpl) {
$_smarty_current_dir = 'C:\\xampp\\htdocs\\portfolio\\assets\\frontend\\mains';
?><section class="section_1" style="margin: 0;">
	<!-- Сначало указываем элементы с абсолютным расположением, а потом с относительным-->
	<div class="corners">
		<p class="corner_top_left" id="1">∟</p>
		<p class="corner_top_right" id="2">∟</p>
		<p class="corner_bottom_left" id="3">∟</p>
		<p class="corner_bottom_right" id="4">∟</p>
	</div>
	<h2 class="logotype font-logo">ПОРТФОЛИО</h2>
	<p class="p_1">БК 536</p>
	<div class="an-1">
		<p class="p_2">Здесь представлены лучшие проекты наших талантливых студентов</p>
		<p class="p_3">↓</p>
	</div>
</section>
<section class="section_2" data-aos="fade-up" style="margin-bottom: 5vh;">
	<div style="width: 100%; height: fit-content; padding-bottom: 2%; padding-left: 20%; padding-right: 20%; margin: 0%;">
		<!--<article style="display: grid; width: 80%; align-self: flex-start;">
			<h1 class="HelveticaMain" style="justify-self: start;">Представляем вам</h1>
			<p class="VasekMain" style="justify-self: center;">лучшие проекты</p>
			<h1 class="HelveticaMain" style="justify-self: end;">базовой кафедры</h1>
		</article>-->
		<?php echo $_smarty_tpl->getSmarty()->getFunctionHandler('query_article')->handle(array('head1'=>"Представляем вам",'head2'=>"лучшие проекты",'head3'=>"базовой кафедры"), $_smarty_tpl);?>

		<div class="container" style="display: flex; flex-direction: column; gap: 30px; margin-top: 3rem; width: 100%;">
			<?php echo $_smarty_tpl->getSmarty()->getFunctionHandler('query_projects')->handle(array('select'=>"*",'from'=>((string)$_smarty_tpl->getValue('tab_projects')),'orderby'=>"id",'limit'=>((string)$_smarty_tpl->getValue('SIZE_PAGE_PROJECTS')),'offset'=>"0"), $_smarty_tpl);?>

		</div>
	</div>
	<div style="display: flex; align-items: center; justify-content: end; flex-direction: row; width: 100%; height: 10%; background-color: #EA5657; padding: 1rem 0 1rem 0;">
		<p class="VasekMainWhiteP">Посмотрите все наши проекты</p>
		<svg onclick="window.location.href='<?php echo $_smarty_tpl->getValue('PROJECTS');?>
'" xmlns="http://www.w3.org/2000/svg" width="32" height="32" fill="currentColor" class="bi bi-arrow-right" viewBox="0 0 16 16" style="color: #F6F6F6; margin: 0 1rem 0 1rem;">
			<path fill-rule="evenodd" d="M1 8a.5.5 0 0 1 .5-.5h11.793l-3.147-3.146a.5.5 0 0 1 .708-.708l4 4a.5.5 0 0 1 0 .708l-4 4a.5.5 0 0 1-.708-.708L13.293 8.5H1.5A.5.5 0 0 1 1 8"></path>
		</svg>
	</div>
</section>
<section class="section_3" style="background-color:rgb(40, 40, 40); border-radius: 25px; box-shadow: 2px 2px 4px rgba(61, 105, 16, 0.5);
}" data-aos="fade-up">
	<!--<article style="display: grid; width: 50%; align-self: flex-start; margin-left: 4%; margin-top: 3rem;">
		<h1 class="HelveticaMainWhite" style="justify-self: start;">А это основные</h1>
		<p class="VasekMain" style="justify-self: center; margin-right: 20%;">направления</p>
		<h1 class="HelveticaMainWhite" style="justify-self: end;">исследований и разработки</h1>
	</article>-->
	<!--<svg xmlns="http://www.w3.org/2000/svg" width="447" height="134" fill="none" viewBox="0 0 447 134">
		<path fill="#EA5657" d="M16.125 63.25c.667-.833 1.417-1 2.25-.5.875.458 1.083 1.167.625 2.125A114.718 114.718 0 0 0 7.937 87.188c-.375.958-1.062 1.354-2.062 1.187-.917-.375-1.292-1.063-1.125-2.063A119.823 119.823 0 0 1 16.125 63.25Zm21.563.188c.583-.834 1.333-1.042 2.25-.626.791.626 1 1.396.624 2.313a174.07 174.07 0 0 0-9.624 23.688c-.459 1-1.146 1.374-2.063 1.124-.917-.291-1.292-.958-1.125-2a178.418 178.418 0 0 1 9.938-24.5ZM37.812 75c1.084.125 1.626.688 1.626 1.688 0 .374-.167.75-.5 1.124-.292.376-.667.542-1.126.5A91.586 91.586 0 0 0 6.75 79.626c-1.083.125-1.75-.27-2-1.188-.25-.958.125-1.624 1.125-2 10.542-2.291 21.188-2.77 31.938-1.437Zm28.438 3.438c-.708.833-1.542 1.02-2.5.562-.917-.5-1.146-1.25-.688-2.25a37.516 37.516 0 0 0 2-3c.667-1.083.834-2.23.5-3.438-.791-2.083-2.458-3.333-5-3.75-2.458-.291-4.833.146-7.124 1.313-2.292 1.167-4.126 2.604-5.5 4.313-1.292 1.541-2.25 3.312-2.876 5.312-.583 1.958-.312 3.813.813 5.563 1.333 1.541 3.125 2.229 5.375 2.062 2.25-.208 4.188-.98 5.813-2.313a30.945 30.945 0 0 0 4.437-4.624 29.524 29.524 0 0 1 4.563-4.563c1-.625 1.874-.604 2.624.063.792.666.792 1.416 0 2.25-.333.541-.541 1.291-.624 2.25a29.464 29.464 0 0 0-.563 3.25c-.25 2.083.583 3.75 2.5 5 .708.75.708 1.52 0 2.312-.875.625-1.77.625-2.688 0-2.541-1.917-3.729-4.354-3.562-7.313.167-1.458.417-2.916.75-4.374.083-1.334.604-2.48 1.563-3.438.874.75 1.75 1.52 2.624 2.313a46.331 46.331 0 0 0-5.937 6.187c-1.792 2.25-4.104 4-6.938 5.25-2.874 1.167-5.791 1.313-8.75.438-2.958-1.042-4.833-2.917-5.624-5.626-.626-2.624-.376-5.187.75-7.687a18.638 18.638 0 0 1 4.937-6.438c2.292-2 5.042-3.437 8.25-4.312 3.25-.917 6.375-.688 9.375.688 2.75 1.5 4.333 3.645 4.75 6.437a7.108 7.108 0 0 1-.938 4 47.184 47.184 0 0 1-2.312 3.563Zm15.375-15.313c.583-.833 1.27-1 2.063-.5.833.458 1.062 1.167.687 2.125-4 7.25-7.23 14.833-9.688 22.75-.458.917-1.124 1.27-2 1.063-.874-.25-1.229-.896-1.062-1.938a126.88 126.88 0 0 1 10-23.5Zm18.937.188c.542-.792 1.25-.98 2.126-.563.791.583.979 1.313.562 2.188a193.562 193.562 0 0 0-8.375 23.437c-.417.958-1.063 1.313-1.938 1.063-.874-.25-1.25-.876-1.124-1.876a191.206 191.206 0 0 1 8.749-24.25Zm3.938-.75c1.042.124 1.562.645 1.562 1.562 0 .417-.166.792-.5 1.125-.291.333-.645.5-1.062.5a75.412 75.412 0 0 0-27.125 2.563c-1 .124-1.625-.25-1.875-1.126-.25-.916.104-1.562 1.063-1.937C85.686 62.667 95 61.77 104.5 62.562Zm9.875 5.937c.75-.583 1.479-.583 2.187 0 .584.708.584 1.438 0 2.188a27.026 27.026 0 0 0-1.75 2.5c-1.041 1.541-1.791 3.291-2.25 5.25-.416 1.958.063 3.708 1.438 5.25 1.375 1.333 2.917 1.916 4.625 1.75 1.708-.167 3.313-.75 4.813-1.75 3.291-2.126 5.624-5.021 7-8.688 1.041-3.292.312-6.063-2.188-8.313-1.167-.833-2.5-1.208-4-1.124-1.667.166-3.208.77-4.625 1.812A15.495 15.495 0 0 0 116.062 71a27.808 27.808 0 0 0-2.562 4.438 125.33 125.33 0 0 0-4.625 10.874 231.18 231.18 0 0 0-5.063 14.25 279.97 279.97 0 0 0-7.562 29c-.333.876-.958 1.25-1.875 1.126-.875-.376-1.23-1.021-1.063-1.938.25-1.333.521-2.667.813-4a260.197 260.197 0 0 1 9-31.75 247.652 247.652 0 0 1 5.563-14.313 40.868 40.868 0 0 1 5.874-10.75A16.84 16.84 0 0 1 119.188 64c1.833-1.083 3.791-1.604 5.874-1.563 4.25.5 7.084 2.792 8.5 6.876.626 2.083.626 4.145 0 6.187-.624 2-1.604 3.854-2.937 5.563a21.941 21.941 0 0 1-4.813 4.812 14.336 14.336 0 0 1-6.25 2.625c-2.25.25-4.333-.23-6.25-1.438-1.916-1.208-3.166-2.958-3.75-5.25-.416-2.458-.104-4.812.938-7.062a28.086 28.086 0 0 1 3.875-6.25Zm45.125 9.938c-.708.833-1.542 1.02-2.5.562-.917-.5-1.146-1.25-.688-2.25a37.063 37.063 0 0 0 2-3c.667-1.083.834-2.23.5-3.438-.791-2.083-2.458-3.333-5-3.75-2.458-.291-4.833.146-7.124 1.313-2.292 1.167-4.126 2.604-5.5 4.313-1.292 1.541-2.25 3.312-2.876 5.312-.583 1.958-.312 3.813.813 5.563 1.333 1.541 3.125 2.229 5.375 2.062 2.25-.208 4.188-.98 5.812-2.313a30.95 30.95 0 0 0 4.438-4.624 29.521 29.521 0 0 1 4.562-4.563c1-.625 1.876-.604 2.626.063.791.666.791 1.416 0 2.25-.334.541-.542 1.291-.626 2.25a29.462 29.462 0 0 0-.562 3.25c-.25 2.083.583 3.75 2.5 5 .708.75.708 1.52 0 2.312-.875.625-1.771.625-2.688 0-2.541-1.917-3.729-4.354-3.562-7.313.167-1.458.417-2.916.75-4.374.083-1.334.604-2.48 1.562-3.438.876.75 1.75 1.52 2.626 2.313A46.335 46.335 0 0 0 156 82.124c-1.792 2.25-4.104 4-6.938 5.25-2.874 1.167-5.791 1.313-8.75.438-2.958-1.042-4.833-2.917-5.624-5.626-.626-2.624-.376-5.187.75-7.687a18.628 18.628 0 0 1 4.937-6.438c2.292-2 5.042-3.437 8.25-4.312 3.25-.917 6.375-.688 9.375.688 2.75 1.5 4.333 3.645 4.75 6.437a7.105 7.105 0 0 1-.938 4 47.177 47.177 0 0 1-2.312 3.563Zm18.125-12.5c1.083-.167 1.833.25 2.25 1.25.167 1.083-.25 1.833-1.25 2.25-4.25.958-6.833 3.541-7.75 7.75-.25 1.916.146 3.604 1.187 5.062 1.084 1.417 2.584 2.292 4.5 2.625 2.042.292 3.876-.104 5.5-1.188 1.667-1.083 2.938-2.5 3.813-4.25a10.78 10.78 0 0 0 1.187-5.687c-.25-1.708-1.187-2.896-2.812-3.563a10.097 10.097 0 0 0-2.5-.687 20.95 20.95 0 0 1-3.188-.25 5.819 5.819 0 0 1-2.687-1.438 53.9 53.9 0 0 1-2.187-2.187c-.459-.542-.626-1.125-.5-1.75.166-.667.604-1.104 1.312-1.313a74.322 74.322 0 0 0 10.688-3.062 46.97 46.97 0 0 0 9.5-4.438c4.791-3.083 7.895-7.374 9.312-12.874.375-1.334.542-2.688.5-4.063 0-1.292-.229-2.438-.688-3.438a1.227 1.227 0 0 0-.437-.374c-.25-.084-.5-.146-.75-.188a7.834 7.834 0 0 0-2.75.375c-4.917 1.458-9.125 4.083-12.625 7.875-2 2.042-3.729 4.396-5.188 7.063-1.458 2.666-2.062 5.5-1.812 8.5 0 .5-.188.937-.562 1.312-.376.333-.792.5-1.25.5-1.042 0-1.646-.604-1.813-1.813-.25-4.041.708-7.791 2.875-11.25a38.164 38.164 0 0 1 7-8.687 32.17 32.17 0 0 1 8.312-5.438 21.703 21.703 0 0 1 6.75-2c2.834-.25 4.792.938 5.876 3.563.958 3.167.937 6.354-.063 9.563-1.917 6.5-5.771 11.479-11.563 14.937A59.084 59.084 0 0 1 186 63.063a78.107 78.107 0 0 1-10.562 3c.25-1 .52-2 .812-3 .792 1 1.688 1.854 2.688 2.562a4.449 4.449 0 0 0 1.812.25c.667 0 1.333.063 2 .188 2.708.374 4.896 1.604 6.562 3.687a7.14 7.14 0 0 1 1.313 3.75 12.943 12.943 0 0 1-.25 4 15.104 15.104 0 0 1-3.313 6.688c-1.791 2.041-3.979 3.374-6.562 4-2.583.624-5.104.374-7.562-.75-2.376-1.209-4.021-2.98-4.938-5.313-.917-2.333-1-4.75-.25-7.25 1.667-4.792 4.958-7.77 9.875-8.938Zm18.687 23.624c-.958.459-1.75.25-2.374-.624-.459-.959-.25-1.75.624-2.376 9.876-7.666 19.167-16 27.876-25 .666-.583 1.354-.666 2.062-.25.75.417 1.021 1.063.812 1.938A193.403 193.403 0 0 0 219.688 88c-.376 1-1.084 1.396-2.126 1.188-.958-.376-1.354-1.084-1.187-2.126a186.346 186.346 0 0 1 5.563-24.75c1 .584 1.979 1.167 2.937 1.75a262.82 262.82 0 0 1-28.563 25.5Zm30.126-6.874c-.459.041-.855-.126-1.188-.5-.333-.376-.5-.771-.5-1.188 0-.958.562-1.5 1.688-1.625A91.328 91.328 0 0 0 235.75 78a35.444 35.444 0 0 0 8.938-3.063 18.983 18.983 0 0 0 6.437-4.874c.792-.876 1.167-1.855 1.125-2.938-.125-.5-.458-.833-1-1a4.9 4.9 0 0 0-1.438-.375c-2.916-.292-5.604.25-8.062 1.625-2.458 1.375-4.333 3.354-5.625 5.938-1.167 2.458-1.542 5.02-1.125 7.687.208 1.25.812 2.23 1.812 2.938a7.018 7.018 0 0 0 3 1.062A13.095 13.095 0 0 0 247 83.437a27.878 27.878 0 0 0 6.188-4.062c.791-.667 1.583-.667 2.374 0 .626.792.626 1.583 0 2.375-2.541 2.292-5.541 4.146-9 5.563-3.416 1.416-6.812 1.479-10.187.187-2.25-1.083-3.708-2.688-4.375-4.813-.625-2.124-.688-4.374-.188-6.75.5-2.374 1.334-4.458 2.5-6.25 2.042-3 4.771-5.124 8.188-6.374 1.583-.584 3.292-.917 5.125-1 1.875-.126 3.604.145 5.187.812 1.709.833 2.646 2.208 2.813 4.125-.042 1.792-.646 3.396-1.813 4.813A22.778 22.778 0 0 1 246 78a40.329 40.329 0 0 1-9.562 3.188 103.48 103.48 0 0 1-10 1.5ZM271 63.25c.667-.833 1.417-1 2.25-.5.875.458 1.083 1.167.625 2.125a114.777 114.777 0 0 0-11.063 22.313c-.374.958-1.062 1.354-2.062 1.187-.917-.375-1.292-1.063-1.125-2.063A119.803 119.803 0 0 1 271 63.25Zm21.562.188c.584-.834 1.334-1.042 2.25-.626.792.626 1 1.396.626 2.313a174.21 174.21 0 0 0-9.626 23.688c-.458 1-1.145 1.374-2.062 1.124-.917-.291-1.292-.958-1.125-2a178.466 178.466 0 0 1 9.937-24.5ZM292.688 75c1.083.125 1.624.688 1.624 1.688 0 .374-.166.75-.5 1.124-.291.376-.666.542-1.124.5a91.589 91.589 0 0 0-31.063 1.313c-1.083.125-1.75-.27-2-1.188-.25-.958.125-1.624 1.125-2 10.542-2.291 21.188-2.77 31.938-1.437Zm12.187-11.938c.667-.833 1.417-1 2.25-.5.833.459 1.042 1.188.625 2.188a120.333 120.333 0 0 0-10.188 22.375c-.5.958-1.208 1.313-2.124 1.063-.917-.25-1.271-.896-1.063-1.938a124.794 124.794 0 0 1 10.5-23.188Zm-7.687 24.75c-1 .376-1.75.146-2.25-.687-.459-.833-.271-1.563.562-2.188A268.873 268.873 0 0 0 327.188 64c.708-.375 1.374-.292 2 .25.5.583.583 1.25.25 2-3.5 7.5-6.459 15.188-8.876 23.063-.416 1-1.104 1.374-2.062 1.124-.917-.25-1.292-.916-1.125-2a194.768 194.768 0 0 1 9.187-23.874l2.25 2.25a266.794 266.794 0 0 1-31.624 21Zm29.25 3c-1.042.167-1.688-.187-1.938-1.062-.208-.917.146-1.604 1.062-2.063a22.401 22.401 0 0 0 5.376-2.437 103.522 103.522 0 0 0 5-3.25l11.124-7.5c.917-.458 1.605-.27 2.063.563.5.791.354 1.52-.437 2.187L337.312 85a40.235 40.235 0 0 1-10.874 5.813Zm20.5-28.25c.916.417 1.25 1.084 1 2-.209.917-.834 1.292-1.876 1.126-1.958-.5-3.833-.105-5.624 1.187-1.626 1.083-2.855 2.625-3.688 4.625-.833 1.958-.5 3.708 1 5.25.708.583 1.542.854 2.5.813a8.247 8.247 0 0 0 2.688-.688c2-.875 3.374-2.313 4.124-4.313.459-.958 1.126-1.312 2-1.062.917.25 1.292.896 1.126 1.938-1.25 3.374-3.584 5.645-7 6.812a8.97 8.97 0 0 1-4.313.438c-1.417-.209-2.667-.876-3.75-2-1.958-2.417-2.458-5.126-1.5-8.126.958-2.666 2.687-4.854 5.187-6.562 2.542-1.708 5.25-2.188 8.126-1.438Zm3.25 1.75c.458-.958 1.145-1.312 2.062-1.062.917.25 1.271.896 1.062 1.938-1.416 4-2.75 8.083-4 12.25A56.332 56.332 0 0 0 347.125 90c-.167 1.042-.729 1.563-1.687 1.563-.917 0-1.417-.521-1.5-1.563.208-4.417.937-8.75 2.187-13 1.25-4.292 2.604-8.52 4.063-12.688Z"/>
		<path fill="#EA5657" d="M348.916 89.535a1.5 1.5 0 1 0-2.755 1.187l2.755-1.187Zm25.468 6.644-.344-1.46.344 1.46Zm23.032-33.522-.005 1.5.005-1.5Zm15.573 22.759-.617-1.367.617 1.367Zm28.911-32.31a1.5 1.5 0 0 0-1.846-1.044l-13.009 3.609a1.5 1.5 0 1 0 .802 2.89l11.563-3.207 3.208 11.563a1.5 1.5 0 1 0 2.891-.802L441.9 53.107Zm-95.739 37.616c1.179 2.736 3.739 5.598 8.35 7.187 4.576 1.578 11.091 1.878 20.216-.27l-.687-2.92c-8.79 2.069-14.688 1.686-18.551.354-3.828-1.32-5.734-3.592-6.573-5.538l-2.755 1.187Zm28.566 6.917c11.612-2.734 22.4-11.35 27.903-19.321 2.712-3.93 4.383-8.051 3.799-11.395-.307-1.76-1.237-3.262-2.842-4.287-1.557-.995-3.636-1.47-6.165-1.48l-.011 3c2.202.008 3.653.428 4.561 1.008.86.549 1.332 1.3 1.502 2.275.371 2.124-.701 5.39-3.313 9.174-5.147 7.456-15.34 15.568-26.121 18.106l.687 2.92Zm22.695-36.482c-13.932-.049-21.024 11.063-18.669 20.1 1.188 4.56 4.757 8.383 10.671 9.786 5.845 1.386 13.876.398 24.183-4.26l-1.235-2.734c-9.98 4.51-17.3 5.25-22.255 4.075-4.887-1.16-7.566-4.19-8.461-7.623-1.811-6.95 3.598-16.386 15.755-16.344l.011-3Zm16.185 25.626c11.706-5.29 19.645-17.495 28.153-32.537l-2.611-1.477c-8.582 15.172-16.097 26.453-26.777 31.28l1.235 2.734Z"/>
	</svg>-->

	<?php echo $_smarty_tpl->getSmarty()->getFunctionHandler('query_article')->handle(array('head1'=>"А это основные",'svg'=>"1",'head3'=>"исследований и разработки",'class'=>"HelveticaMainWhite",'style'=>"width: 85%; padding: 3%;"), $_smarty_tpl);?>

	<div class="interestDiv"> <!-- gap: 30px; -->
		<?php echo $_smarty_tpl->getSmarty()->getFunctionHandler('query_interests')->handle(array(), $_smarty_tpl);?>

	</div>
</section>
<section class="section_4" data-aos="fade-up" style="border: none;">
	<div style="width: 100%;height: fit-content;/* justify-content: flex-end; */display: flex;flex-direction: column;align-items: center;"> <!-- padding-bottom: 2%; padding-top: 3rem; padding-left: 20%; padding-right: 20%; margin: 0%; -->
		<!--<article style="display: grid; width: 100%; align-self: flex-start;">
			<h1 class="HelveticaMain" style="justify-self: start;">Наши звёзды с</h1>
			<p class="VasekMain" style="justify-self: center; margin-right: 30%;">Аллеи Славы</p>/* тут наверное надо придумать как в класс без марджина сделать */
			<h1 class="HelveticaMain" style="justify-self: end; margin-right: 10%;">сияют ярче, чем в Голливуде</h1>
		</article>-->
		<?php echo $_smarty_tpl->getSmarty()->getFunctionHandler('query_article')->handle(array('head1'=>"Наши звёзды с",'svg'=>"2",'head3'=>"сияют ярче, чем в Голливуде",'class'=>"HelveticaMain"), $_smarty_tpl);?>

		<div class="container" style="display: flex; justify-content: space-between; flex-direction: row;  margin-top: 2rem; width: 100%;"> <!-- gap: 30px;-->
			<svg onclick="prevStar.call(this.nextSibling.nextSibling);" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 16 16" fill="%23fff" style="flex-basis: 10%; box-shadow: 20px 0px 10px 0px #ffffff; z-index: 1;">
				<path d="M11.354 1.646a.5.5 0 0 1 0 .708L5.707 8l5.647 5.646a.5.5 0 0 1-.708.708l-6-6a.5.5 0 0 1 0-.708l6-6a.5.5 0 0 1 .708 0z" />
			</svg>
			<div class="carousel" style="width: 100%; "> <!-- display: flex; flex-direction: row; justify-content: center;--> <!--limit="5"-->
				<div class="carousel-inner"> 
					<?php echo $_smarty_tpl->getSmarty()->getFunctionHandler('query_stars')->handle(array('select'=>"*",'from'=>((string)$_smarty_tpl->getValue('tag_awesome')),'orderby'=>"id"), $_smarty_tpl);?>

				</div>
			</div> 
			<svg onclick="nextStar.call(this.previousSibling.previousSibling);" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 16 16" fill="%23fff" style="flex-basis: 10%; box-shadow: -20px 0px 8px 0px #ffffff; z-index: 1;">
				<path d="M4.646 1.646a.5.5 0 0 1 .708 0l6 6a.5.5 0 0 1 0 .708l-6 6a.5.5 0 0 1-.708-.708L10.293 8 4.646 2.354a.5.5 0 0 1 0-.708z" />
			</svg>
		</div>
		<?php echo $_smarty_tpl->getSmarty()->getFunctionHandler('query_article')->handle(array('head1'=>"Лучший",'head2'=>"дизайнер",'head3'=>"месяца",'id'=>"article-item",'class'=>"VasekMain2",'class2'=>"HelveticaMain2",'style'=>"width: 25%;"), $_smarty_tpl);?>

	</div>
</section>
<section class="section_5" data-aos="fade-up">
	<div class="headVacancy2"> <!-- height: fit-content; padding-bottom: 2%; padding-left: 20%; padding-right: 20%; margin: 0%; -->
		<div class="container headVacancy"> <!-- display: flex;flex-direction: row;width: 100%;justify-content: space-between;align-items: flex-end; -->
			<!--<article style="display: grid; width: 50%; align-self: flex-start;">
				<h1 class="HelveticaMain" style="justify-self: start;">Открытые</h1>
				<p class="VasekMain" style="justify-self: center;">вакансии</p>
				<h1 class="HelveticaMain" style="justify-self: end; ">в команды</h1>
			</article>-->
			<?php echo $_smarty_tpl->getSmarty()->getFunctionHandler('query_article')->handle(array('head1'=>"Наши открытые",'head2'=>"вакансии в команды",'head3'=>"лучших разработчиков",'class'=>"HelveticaMain",'style'=>"width: 50%;"), $_smarty_tpl);?>

			<button class="buttonAddVacancy" style="width: auto; height: auto; justify-content: flex-end;">Добавить вакансию
			<svg xmlns="http://www.w3.org/2000/svg" width="15" height="15" fill="none" viewBox="0 0 15 15">
				<path stroke="#858585" stroke-linecap="round" d="M1 7.5h13M7.5 1v13"/>
			</svg>
			</button>
		</div>
		<div class="container vacancies-container" style="display: grid;"> <!--display: grid;-->
			<?php echo $_smarty_tpl->getSmarty()->getFunctionHandler('query_vacancies')->handle(array('style'=>"grid",'select'=>"*",'from'=>((string)$_smarty_tpl->getValue('tab_vacancies')),'orderby'=>"id",'limit'=>((string)$_smarty_tpl->getValue('limit_vacancies')),'offset'=>"0"), $_smarty_tpl);?>

		</div>
	</div>
	<div style="background: #202020; width: 100%;">
		<div class="footerSection" > <!-- style="display: flex; align-items: center; justify-content: end; flex-direction: row; width: 100%; height: 10%; border-radius: 0 0 25px 25px; background-color: #EA5657; padding: 1rem 0 1rem 0;"-->
			<p class="VasekMainWhiteP">Больше вакансий тут</p>
			<svg onclick="window.location.href='<?php echo $_smarty_tpl->getValue('VACANCIES');?>
'" xmlns="http://www.w3.org/2000/svg" width="32" height="32" fill="currentColor" class="bi bi-arrow-right" style="color: #F6F6F6; margin: 0 1rem 0 1rem;" viewBox="0 0 16 16">
				<path fill-rule="evenodd" d="M1 8a.5.5 0 0 1 .5-.5h11.793l-3.147-3.146a.5.5 0 0 1 .708-.708l4 4a.5.5 0 0 1 0 .708l-4 4a.5.5 0 0 1-.708-.708L13.293 8.5H1.5A.5.5 0 0 1 1 8"></path>
			</svg>
		</div>
	</div>
</section>
<?php }
}
